app/controllers/databases_controller.rb

  def index
    @vehicles = Vehicle.all
    @subjects = Subject.all
    @drugs = Drug.all
    @databases = Database.all
---
SELECT "databases".* FROM "databases" WHERE (name LIKE '%APD%')

  def search

    @databases = Database.search(params[:search])
---
SELECT "databases".* FROM "databases"

  def show
    @database = Database.find(params[:id])
---
SELECT "databases".* FROM "databases" WHERE "databases"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @database = Database.find(params[:id])
---
SELECT "databases".* FROM "databases" WHERE "databases"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @database = Database.new(params[:database])

    respond_to do |format|
      if @database.save
---
INSERT INTO "databases" ("address", "city", "created_at", "destination", "dob", "fbin", "first_name", "last_name", "make", "mile_marker", "model", "origin", "other1", "other2", "other3", "other4", "owner", "picture", "registration", "road", "ssn", "state", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @database = Database.find(params[:id])

    respond_to do |format|
      if @database.update_attributes(params[:database])
---
SELECT "databases".* FROM "databases" WHERE "databases"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "databases" SET "street_address" = '3109 Alvarado Dr NE', "city" = 'Albuquerque', "country" = 'United States', "state" = 'NEW MEXICO', "zip" = '87110', "updated_at" = '2013-11-14 19:53:02.907061' WHERE "databases"."id" = 1

  def destroy
    @database = Database.find(params[:id])
    @database.destroy
---
SELECT "databases".* FROM "databases" WHERE "databases"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "databases" WHERE "databases"."id" = ?  [["id", 2]]